#### DataTransferMode Enumeration

---

|  |
| --- |
| See Also |

Describes the data transfer mode.

Describes the data transfer mode.

**Namespace:**   Autodesk.Revit.DB.Events
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017 Subscription Update

# Syntax

| C# |
| --- |
| ``` public enum DataTransferMode ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration DataTransferMode ``` |

| Visual C++ |
| --- |
| ``` public enum class DataTransferMode ``` |

# Members

| Member name | Description |
| --- | --- |
| Undefined | Undefined mode. |
| Download | Transfer data from server to client. |
| Upload | Transfer data from client to server. |

# See Also

Autodesk.Revit.DB.Events Namespace